In [15]:
# Import libraries
import pyodbc as py
import pandas as pd

In [16]:
# Create connection to Microsoft SQL Database
cnxn = py.connect("DRIVER={ODBC Driver 17 for SQL Server};"
                  "SERVER=DESKTOP-1UTCB6C;"
                  "DATABASE=AdventureWorks2017;"
                  "TRUSTED_Connection=yes;")

In [20]:
# create dataframe to look at the top ten pay rates
Salary = pd.read_sql_query ('SELECT * FROM HumanResources.EmployeePayHistory', cnxn)
Salary.sort_values(['Rate'], ascending=False).head(10)

     BusinessEntityID RateChangeDate      Rate  PayFrequency ModifiedDate
0                   1     2009-01-14  125.5000             2   2014-06-30
28                 25     2009-02-03   84.1346             2   2014-06-30
298               273     2011-02-15   72.1154             2   2014-06-30
1                   2     2008-01-31   63.4615             2   2014-06-30
257               234     2012-01-29   60.0962             2   2012-01-15
288               263     2008-12-11   50.4808             2   2014-06-30
8                   7     2009-02-08   50.4808             2   2014-06-30
256               234     2011-11-14   48.5577             2   2011-10-31
299               274     2011-01-04   48.1010             2   2014-06-30
310               285     2013-03-14   48.1010             2   2014-06-30

In [18]:
# Run an SQL query to see the highest pay
MaxSalary = pd.read_sql_query ('SELECT MAX(Rate) AS Rate_Max FROM HumanResources.EmployeePayHistory', cnxn)
MaxSalary

   Rate_Max
0     125.5

In [19]:
# Run an SQL query to see the second highest pay
MaxSalary_2 = pd.read_sql_query ('SELECT MAX(Rate) AS Rate_Max FROM HumanResources.EmployeePayHistory WHERE Rate NOT IN (SELECT MAX(Rate) FROM HumanResources.EmployeePayHistory)', cnxn)
MaxSalary_2

   Rate_Max
0   84.1346